Shounak Joshi <br>
DSCI 552 <br>
USC ID: 5777190279

4. This section is for practicing basic funtions of the Pandas library using the Salaries data set. <br>
(a) Consider the Salaries.csv file. <br>
(b) Use the read_csv(...) method from Pandas (Documentation Link) to read data 
from file Salaries.csv and to copy it into a dataframe.<br>
(c) Make the column playerID in the csv file as the index column and the first row
as the header. Also, skip the second row when reading the file.<br>
(d) Select the id of the players who are registered in ATL and HOU whose salary is
higher than one million.<br>
(e) Use the describe() method to calculate the standard deviation, first quartile, median, third quartile, mean, maximum, and minimum of the salary in team ATL.

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('Salaries.csv',index_col='playerID')
#pd.read_csv('Salaries.csv', header=1)
# pd.read_csv('Salaries.csv', skiprows=[2], header=None)

           yearID teamID lgID    salary
playerID
barkele01    1985    ATL   NL    870000
bedrost01    1985    ATL   NL    550000
benedbr01    1985    ATL   NL    545000
campri01     1985    ATL   NL    633333
ceronri01    1985    ATL   NL    625000
...           ...    ...  ...       ...
treinbl01    2015    WAS   NL    512800
ugglada01    2015    WAS   NL    507500
werthja01    2015    WAS   NL  21000000
zimmejo02    2015    WAS   NL  16500000
zimmery01    2015    WAS   NL  14000000

[25575 rows x 4 columns]

In [3]:
import pandas as pd
data = pd.read_csv('Salaries.csv',index_col='playerID')
greater_than_1_mil = data[((data.teamID=='ATL') | (data.teamID=='HOU')) & (data.salary>=1000000)]
print ('Number of players with ALT or HOU having salary greater than 1 million : ', greater_than_1_mil.shape[0])
print (greater_than_1_mil)

Number of players with ALT or HOU having salary greater than 1 million :  625
           yearID teamID lgID   salary
playerID
hornebo01    1985    ATL   NL  1500000
murphda05    1985    ATL   NL  1625000
suttebr01    1985    ATL   NL  1354167
ryanno01     1985    HOU   NL  1350000
hornebo01    1986    ATL   NL  1800000
...           ...    ...  ...      ...
rasmuco01    2015    HOU   AL  8000000
singljo02    2015    HOU   AL  2000000
sippto01     2015    HOU   AL  2400000
thatcjo01    2015    HOU   AL  1000000
valbulu01    2015    HOU   AL  4200000

[625 rows x 4 columns]